import json, requests, re
from fastapi import Cookie
proxies = {'http': "http://127.0.0.1:8888",
           'https': "https://127.0.0.1:8888"}

cookie = {  'iPlanetDirectoryPro':'lZUwSEoetOf9fDP6G5wJjr','JSESSIONID':'C7E567EE8507CAF9F8597FF94B1519B7'}

y_building_dict = { "16栋A区":"471","16栋B区":"472","17栋":"451","弘毅轩1栋A区":"141","弘毅轩1栋B区":"148","弘毅轩2栋A区1-6楼":"197","弘毅轩2栋B区":"201","弘毅轩2栋C区":"205","弘毅轩2栋D区":"206","弘毅轩3栋A区":"155","弘毅轩3栋B区":"183","弘毅轩4栋A区":"162","弘毅轩4栋B区":"169","留学生公寓":"450","敏行轩1栋A区":"176","敏行轩1栋B区":"184","行健轩1栋A区":"85","行健轩1栋B区":"92","行健轩2栋A区":"99","行健轩2栋B区":"106","行健轩3栋A区":"113","行健轩3栋B区":"120","行健轩4栋A区":"127","行健轩4栋B区":"134","行健轩5栋A区":"57","行健轩5栋B区":"64","行健轩6栋A区":"71","行健轩6栋B区":"78","至诚轩1栋A区":"1","至诚轩1栋B区":"8","至诚轩2栋A区":"15","至诚轩2栋B区":"22","至诚轩3栋A区":"29","至诚轩3栋B区":"36","至诚轩4栋A区":"43","至诚轩4栋B区":"50"}
y_building_str = '16栋A区,16栋B区,17栋,弘毅轩1栋A区,弘毅轩1栋B区,弘毅轩2栋A区1-6楼,弘毅轩2栋B区,弘毅轩2栋C区,弘毅轩2栋D区,弘毅轩3栋A区,弘毅轩3栋B区,弘毅轩4栋A区,弘毅轩4栋B区,留学生公寓,敏行轩1栋A区,敏行轩1栋B区,行健轩1栋A区,行健轩1栋B区,行健轩2栋A区,行健轩2栋B区,行健轩3栋A区,行健轩3栋B区,行健轩4栋A区,行健轩4栋B区,行健轩5栋A区,行健轩5栋B区,行健轩6栋A区,行健轩6栋B区,至诚轩1栋A区,至诚轩1栋B区,至诚轩2栋A区,至诚轩2栋B区,至诚轩3栋A区,至诚轩3栋B区,至诚轩4栋A区,至诚轩4栋B区'
j_building_dict = {'西苑2栋':'9','东苑11栋':'178','西苑5栋':'33','东苑14栋':'132','东苑6栋':'131','南苑7栋':'97','东苑9栋':'162','西苑11栋':'75','西苑6栋':'41','东苑4栋':'171','西苑8栋':'57','东苑15栋':'133','西苑9栋':'65','南苑5栋':'96','西苑10栋':'74','东苑12栋':'179','南苑4栋':'95','东苑5栋':'130','西苑3栋':'17','西苑4栋':'25','外教楼':'180','南苑3栋':'94','西苑7栋':'49','西苑1栋':'1','南苑8栋':'98'}
j_building_str = '西苑2栋,东苑11栋,西苑5栋,东苑14栋,东苑6栋,南苑7栋,东苑9栋,西苑11栋,西苑6栋,东苑4栋,西苑8栋,东苑15栋,西苑9栋,南苑5栋,西苑10栋,东苑12栋,南苑4栋,东苑5栋,西苑3栋,西苑4栋,外教楼,南苑3栋,西苑7栋,西苑1栋,南苑8栋'

building = str(input())
room = str(input())
tran = str(input())


y = {'account':'256395','acctype':'###','aid':'0030000000002501','areaid':'云塘校区','areaname':'云塘校区',
    'building':building,'buildingid':y_building_dict[building],
    'floor':'','floorid':'','json':'true','paytype':'1',
    'room':room,'roomid':room,
    'sign':'SH-A7','tran':tran}

j = {'account':'256395','acctype':'###','aid':'0030000000002502','areaid':'金盆岭校区','areaname':'金盆岭校区',
    'building':building,'buildingid':y_building_dict[building],
    'floor':'','floorid':'','json':'true','paytype':'1',
    'room':room,'roomid':room,
    'sign':'SH-A7','tran':tran}

'''
url = 'http://yktwd.csust.edu.cn:8988/web/Elec/PayElecGdc.html'
r = requests.request(method='POST', url=url, proxies=proxies,cookies=cookie, data=j)

print(r.text)
'''